<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2016 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

return [
    // +----------------------------------------------------------------------
    // | api分组设置
    // +----------------------------------------------------------------------

    // 应用调试模式
    'app_debug'              => false,
    // 默认输出类型
    'default_return_type'    => 'json',
    // 异常处理handle类 留空使用 \think\exception\Handle
    'exception_handle'       => 'app\common\lib\exception\ApiHandleException',

];
